# 1.
X="junyiacademy"
flip<-function(X){
  a=nchar(X)
  b=""
  for (i in a:1) {
    b=paste0(b,substr(X,i,i))
    }
  print(b)
  }

flip(X)


X="flipped class room is important"

flip2<-function(X){
  a <-strsplit(X, " ", fixed = TRUE)
  a=nchar(X)
  b=""
  for (i in a:1) {
    b=paste0(b,substr(X,i,i))
  }
  print(b)
}





# 2. 請寫⼀一個程式，Input 是⼀一個數字，Output 是從 1 到這個數字，扣除掉所有 3 的倍數以及 5 的倍數，但是
# 需要保留留同時是 3 和 5 的倍數的總數字數。

# 3.房間裡有三個袋⼦子，⼀一個只裝鉛筆，⼀一個只裝原⼦子筆，第三個有鉛筆也有原⼦子筆，袋⼦子是不透明的，單從
# 袋⼦子的外表上看不出任何差異異，你不知道哪⼀一個袋⼦子裝了了什什麼。除了了袋⼦子上各貼了了⼀一個標⽰示("鉛筆"、"原⼦子
#                                                     筆"、"混和")，⽽而且標⽰示都是錯的(ex. 標有鉛筆的袋⼦子⼀一定不是只裝鉛筆)。
# 你只能選⼀一個袋⼦子，然後拿出裡⾯面⼀一⽀支筆看是鉛筆還是原⼦子筆，然後你要推論出這三個袋⼦子分別的情況。請
# 列列出您的作法，以及解釋為什什麼這樣可以找到答案。



# 4.有三個⼈人⼀一起到迪⼠士尼遊玩，中午肚⼦子餓了了，去餐廳點了了⼀一份現在最夯的冰雪奇緣雙⼈人組，要價 900 元，
# 付錢後，服務⽣生發現今天套餐⼤大特價，只要 750 元，因此服務⽣生應該退還 150 元給這三個⼈人，但是這位服務
# ⽣生⼀一時⿁鬼迷⼼心翹，決定按扛 60 元，只退了了 90 元給這三個遊客。
# 那麼： 三⼈人各出 300 元 - 服務⽣生還給他們⼀一⼈人 30 元 = 三⼈人各出 270 元 270元 × 3⼈人 + 服務⽣生私吞的 60 元
# = 810 + 60 = 870 !? 怎麼不是 900 元呢？還有 30元去哪了了呢？ 請⽤用敘述的⽅方式，儘量量清楚解釋問題出在哪
# 裡。